# 2. Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой двух других.
# Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним, равнобедренным или равносторонним.

def check_triangle(a, b, c):
    if a + b <= c or a + c <= b or b + c <= a:
        return "Треугольник с такими сторонами не существует."
    else:
        if a == b == c:
            return "Треугольник равносторонний."
        elif a == b or a == c or b == c:
            return "Треугольник равнобедренный."
        else:
            return "Треугольник разносторонний."


a, b, c = 3, 4, 5
print(check_triangle(a, b, c))
